Repository: Wearablock/easy-spanish-grammar-and-words
Catalog: lib/l10n/app_*.arb
Languages: ar, de, id, ko, th, vi

# appTitle
source: Easy Spanish
ar: إسبانية سهلة
de: Spanisch Leicht
id: Spanyol Mudah
ko: 쉬운 스페인어
th: สเปนง่ายๆ
vi: Học Tây Ban Nha

# appFullTitle
source: Easy Spanish - Grammar & Words
ar: إسبانية سهلة - قواعد وكلمات
de: Spanisch Leicht - Grammatik
id: Spanyol Mudah - Tata Bahasa
ko: 쉬운 스페인어 - 문법 & 단어
th: สเปนง่ายๆ - ไวยากรณ์และคำศัพท์
vi: Học Tây Ban Nha - Ngữ Pháp

source: Home
ar: الرئيسية
de: Start
id: Beranda
ko: 홈
th: หน้าหลัก
vi: Trang chủ

source: Progress
ar: التقدم
de: Fortschritt
id: Progres
ko: 진행률
th: ความคืบหน้า
vi: Tiến trình

source: Settings
ar: الإعدادات
de: Einstellungen
id: Pengaturan
ko: 설정
th: ตั้งค่า
vi: Cài đặt

source: Wrong Answers
ar: الأخطاء
de: Fehlerliste
id: Jawaban Salah
ko: 오답노트
th: ข้อผิดพลาด
vi: Câu sai

# error
source: Error: {message}
ar: خطأ: {message}
de: Fehler: {message}
ko: 오류: {message}
th: ข้อผิดพลาด: {message}
vi: Lỗi: {message}

source: Start Study
ar: بدء الدراسة
de: Lernen starten
id: Mulai belajar
ko: 학습 시작하기
th: เริ่มเรียน
vi: Bắt đầu học

source: Continue Study
ar: متابعة الدراسة
de: Lernen fortsetzen
id: Lanjutkan belajar
ko: 학습 이어하기
th: เรียนต่อ
vi: Tiếp tục học

source: Start Review
ar: مراجعة
de: Wiederholen
id: Ulang
ko: 복습하기
th: ทบทวน
vi: Ôn tập

# todayStudy
source: Today's Study
ar: دراسة اليوم
de: Heutiges Lernen
id: Belajar hari ini
ko: 오늘의 학습
th: การเรียนวันนี้
vi: Học hôm nay

source: All Topics Completed!
ar: تم إكمال جميع المواضيع!
de: Alle Themen abgeschlossen!
id: Semua topik selesai!
ko: 모든 주제 학습 완료!
th: เรียนครบทุกหัวข้อแล้ว!
vi: Đã hoàn thành tất cả chủ đề!

# reviewEncouragement
source: Keep practicing with reviews to master the content.
ar: استمر في المراجعة لإتقان المحتوى.
de: Wiederhole weiter, um den Stoff zu meistern.
id: Terus mengulang untuk menguasai materi.
ko: 복습을 통해 실력을 더욱 쌓아보세요.
th: ทบทวนต่อเพื่อเชี่ยวชาญเนื้อหา
vi: Tiếp tục ôn tập để nắm vững nội dung.

source: Next Topic
ar: الموضوع التالي
de: Nächstes Thema
id: Topik selanjutnya
ko: 다음 주제
th: หัวข้อถัดไป
vi: Chủ đề tiếp theo

# questionsCount
source: {count} questions
ar: {count} أسئلة
de: {count} Fragen
id: {count} soal
ko: {count}문제
th: {count} ข้อ
vi: {count} câu

# todayQuestionsCompleted
source: {count} questions completed today
ar: تم إكمال {count} سؤال اليوم
de: {count} Fragen heute erledigt
id: {count} soal selesai hari ini
ko: 오늘 {count}문제 학습 완료
th: ทำเสร็จ {count} ข้อวันนี้
vi: Đã hoàn thành {count} câu hôm nay

# todayGoal
source: Today's Goal
ar: هدف اليوم
de: Heutiges Ziel
id: Target hari ini
ko: 오늘의 목표
th: เป้าหมายวันนี้
vi: Mục tiêu hôm nay

# topicsProgress
source: {studied}/{goal} topics
ar: {studied}/{goal} مواضيع
de: {studied}/{goal} Themen
id: {studied}/{goal} topik
ko: {studied}/{goal} 주제
th: {studied}/{goal} หัวข้อ
vi: {studied}/{goal} chủ đề

# streakDays
source: {days} day streak!
ar: {days} أيام متتالية!
de: {days} Tage in Folge!
id: {days} hari berturut-turut!
ko: 연속 {days}일째 학습 중!
th: เรียนติดต่อกัน {days} วัน!
vi: Học liên tục {days} ngày!

source: Overall Progress
ar: التقدم العام
de: Gesamtfortschritt
id: Progres keseluruhan
ko: 전체 진행률
th: ความคืบหน้าโดยรวม
vi: Tiến trình chung

source: Mastered
ar: متقن
de: Gemeistert
id: Dikuasai
ko: 완전 습득
th: เชี่ยวชาญ
vi: Đã thành thạo

source: Studied Once
ar: تمت دراسته مرة واحدة على الأقل
de: Mindestens einmal gelernt
id: Dipelajari setidaknya sekali
ko: 1회 이상 학습
th: เรียนแล้วอย่างน้อย 1 ครั้ง
vi: Đã học ít nhất 1 lần

# totalQuestions
source: Total {count} questions
ar: إجمالي {count} سؤال
de: Insgesamt {count} Fragen
id: Total {count} soal
ko: 총 {count}문제
th: ทั้งหมด {count} ข้อ
vi: Tổng {count} câu

# questionsMastered
source: {count} / {total} questions mastered
ar: {count} / {total} سؤال متقن
de: {count} / {total} Fragen gemeistert
id: {count} / {total} soal dikuasai
ko: {count} / {total} 문제 완전 습득
th: เชี่ยวชาญ {count} / {total} ข้อ
vi: Thành thạo {count} / {total} câu

source: Study
ar: الدراسة
de: Lernen
id: Belajar
ko: 학습
th: เรียน
vi: Học

source: Notifications
ar: الإشعارات
de: Benachrichtigungen
id: Notifikasi
ko: 알림
th: การแจ้งเตือน
vi: Thông báo

source: App Settings
ar: إعدادات التطبيق
de: App-Einstellungen
id: Pengaturan aplikasi
ko: 앱 설정
th: ตั้งค่าแอป
vi: Cài đặt ứng dụng

source: Info
ar: معلومات
id: Informasi
ko: 정보
th: ข้อมูล
vi: Thông tin

source: App Version
ar: إصدار التطبيق
id: Versi aplikasi
ko: 앱 버전
th: เวอร์ชันแอป
vi: Phiên bản

# termsAndPolicies
source: Terms & Policies
ar: الشروط والسياسات
de: Bedingungen & Richtlinien
id: Syarat & kebijakan
ko: 약관 및 정책
th: เงื่อนไขและนโยบาย
vi: Điều khoản & chính sách

source: Terms of Service
ar: شروط الخدمة
de: Nutzungsbedingungen
id: Syarat layanan
ko: 이용약관
th: เงื่อนไขการใช้งาน
vi: Điều khoản sử dụng

source: Privacy Policy
ar: سياسة الخصوصية
de: Datenschutzrichtlinie
id: Kebijakan privasi
ko: 개인정보 처리방침
th: นโยบายความเป็นส่วนตัว
vi: Chính sách bảo mật

source: Support
ar: الدعم
id: Dukungan
ko: 고객 지원
th: สนับสนุน
vi: Hỗ trợ

source: Data
ar: البيانات
de: Daten
ko: 데이터
th: ข้อมูล
vi: Dữ liệu

source: Reset Study Records
ar: إعادة تعيين السجلات
de: Lernaufzeichnungen zurücksetzen
id: Reset data belajar
ko: 학습 기록 초기화
th: รีเซ็ตบันทึกการเรียน
vi: Đặt lại dữ liệu học

# resetStudyRecordsDesc
source: Delete all study records
ar: حذف جميع سجلات الدراسة
de: Alle Lernaufzeichnungen löschen
id: Hapus semua data belajar
ko: 모든 학습 기록을 삭제합니다
th: ลบบันทึกการเรียนทั้งหมด
vi: Xóa tất cả dữ liệu học

# resetStudyRecordsConfirm
source: All study records will be deleted. This action cannot be undone.
ar: سيتم حذف جميع سجلات الدراسة. لا يمكن التراجع عن هذا الإجراء.
de: Alle Lernaufzeichnungen werden gelöscht. Diese Aktion kann nicht rückgängig gemacht werden.
id: Semua data belajar akan dihapus. Tindakan ini tidak dapat dibatalkan.
ko: 모든 학습 기록이 삭제됩니다. 이 작업은 되돌릴 수 없습니다.
th: บันทึกการเรียนทั้งหมดจะถูกลบ ไม่สามารถย้อนกลับได้
vi: Tất cả dữ liệu học sẽ bị xóa. Không thể hoàn tác.

source: Cannot open link.
ar: تعذر فتح الرابط.
de: Link kann nicht geöffnet werden.
id: Tidak dapat membuka tautan.
ko: 링크를 열 수 없습니다.
th: ไม่สามารถเปิดลิงก์ได้
vi: Không thể mở liên kết.

source: Cancel
ar: إلغاء
de: Abbrechen
id: Batal
ko: 취소
th: ยกเลิก
vi: Hủy

source: Reset
ar: إعادة تعيين
de: Zurücksetzen
ko: 초기화
th: รีเซ็ต
vi: Đặt lại

source: Confirm
ar: تأكيد
de: Bestätigen
id: Konfirmasi
ko: 확인
th: ยืนยัน
vi: Xác nhận

# studyRecordsReset
source: Study records have been reset.
ar: تمت إعادة تعيين سجلات الدراسة.
de: Lernaufzeichnungen wurden zurückgesetzt.
id: Data belajar telah direset.
ko: 학습 기록이 초기화되었습니다.
th: รีเซ็ตบันทึกการเรียนแล้ว
vi: Đã đặt lại dữ liệu học.

source: Daily Study Amount
ar: كمية الدراسة اليومية
de: Tägliche Lernmenge
id: Jumlah belajar harian
ko: 일일 학습량
th: ปริมาณการเรียนรายวัน
vi: Lượng học hàng ngày

# topicsUnit
source: {count} topics
ar: {count} مواضيع
de: {count} Themen
id: {count} topik
ko: {count}주제
th: {count} หัวข้อ
vi: {count} chủ đề

# customSetting
source: Custom
ar: مخصص
de: Benutzerdefiniert
id: Kustom
ko: 직접 설정
th: กำหนดเอง
vi: Tùy chỉnh

source: Theme
ar: المظهر
de: Design
id: Tema
ko: 테마
th: ธีม
vi: Giao diện

source: Select Theme
ar: اختيار المظهر
de: Design wählen
id: Pilih tema
ko: 테마 선택
th: เลือกธีม
vi: Chọn giao diện

# themeSystem
source: System Default
ar: النظام
de: Systemstandard
id: Sistem
ko: 시스템 설정
th: ตามระบบ
vi: Theo hệ thống

# themeLight
source: Light Mode
ar: الوضع الفاتح
de: Heller Modus
id: Mode terang
ko: 라이트 모드
th: โหมดสว่าง
vi: Chế độ sáng

# themeDark
source: Dark Mode
ar: الوضع الداكن
de: Dunkler Modus
id: Mode gelap
ko: 다크 모드
th: โหมดมืด
vi: Chế độ tối

source: Study Complete
ar: اكتملت الدراسة
de: Lernen abgeschlossen
id: Belajar selesai
ko: 학습 완료
th: เรียนเสร็จแล้ว
vi: Hoàn thành học

source: Good job!
ar: أحسنت!
de: Gut gemacht!
id: Kerja bagus!
ko: 수고하셨습니다
th: ดีมาก!
vi: Tốt lắm!

source: Go Home
ar: العودة للرئيسية
de: Zur Startseite
id: Ke beranda
ko: 홈으로
th: กลับหน้าหลัก
vi: Về trang chủ

source: Accuracy
ar: الدقة
de: Genauigkeit
id: Akurasi
ko: 정답률
th: ความแม่นยำ
vi: Độ chính xác

source: Correct
ar: صحيح
de: Richtig
id: Benar
ko: 정답
th: ถูก
vi: Đúng

source: Wrong
ar: خطأ
de: Falsch
id: Salah
ko: 오답
th: ผิด
vi: Sai

source: Time Spent
ar: الوقت المستغرق
de: Zeitaufwand
id: Waktu
ko: 소요 시간
th: เวลาที่ใช้
vi: Thời gian

source: Wrong Review
ar: مراجعة الأخطاء
de: Fehlerwiederholung
id: Ulang jawaban salah
ko: 오답 복습
th: ทบทวนข้อผิด
vi: Ôn lại câu sai

source: Spaced Review
ar: المراجعة المتباعدة
de: Verteilte Wiederholung
id: Ulang berjarak
ko: 망각곡선 복습
th: ทบทวนแบบเว้นระยะ
vi: Ôn tập giãn cách

source: New Learning
ar: تعلم جديد
de: Neues Lernen
id: Belajar baru
ko: 신규 학습
th: เรียนรู้ใหม่
vi: Học mới

# errorOccurred
source: An error occurred
ar: حدث خطأ
de: Ein Fehler ist aufgetreten
id: Terjadi kesalahan
ko: 오류가 발생했습니다
th: เกิดข้อผิดพลาด
vi: Đã xảy ra lỗi

source: Retry
ar: إعادة المحاولة
de: Erneut versuchen
id: Coba lagi
ko: 다시 시도
th: ลองอีกครั้ง
vi: Thử lại

source: Stop Study
ar: إيقاف الدراسة
de: Lernen stoppen
id: Hentikan belajar
ko: 학습 중단
th: หยุดเรียน
vi: Dừng học

# stopStudyConfirm
source: Do you want to stop studying? Your progress will be saved.
ar: هل تريد إيقاف الدراسة؟ سيتم حفظ تقدمك.
de: Möchtest du das Lernen stoppen? Dein Fortschritt wird gespeichert.
id: Ingin menghentikan belajar? Progres akan disimpan.
ko: 학습을 중단하시겠습니까? 현재까지의 진행 상황은 저장됩니다.
th: ต้องการหยุดเรียนหรือไม่? ความคืบหน้าจะถูกบันทึก
vi: Bạn muốn dừng học? Tiến trình sẽ được lưu.

# continueStudyButton
source: Continue
ar: متابعة
de: Weiterlernen
id: Lanjutkan
ko: 계속 학습
th: เรียนต่อ
vi: Tiếp tục

source: Stop
ar: إيقاف
de: Stoppen
id: Hentikan
ko: 중단
th: หยุด
vi: Dừng

# levelProgress
source: Progress by Level
ar: التقدم حسب المستوى
de: Fortschritt nach Stufe
id: Progres per level
ko: 레벨별 진행률
th: ความคืบหน้าตามระดับ
vi: Tiến trình theo cấp độ

# reviewAvailable
source: You have questions to review!
ar: لديك أسئلة للمراجعة!
de: Du hast Fragen zum Wiederholen!
id: Ada soal yang perlu diulang!
ko: 복습할 문제가 있어요!
th: มีข้อที่ต้องทบทวน!
vi: Có câu cần ôn tập!

# reviewWaiting
source: {count} questions waiting for review
ar: {count} أسئلة بانتظار المراجعة
de: {count} Fragen warten auf Wiederholung
id: {count} soal menunggu pengulangan
ko: {count}개의 문제가 복습을 기다려요
th: {count} ข้อรอทบทวน
vi: {count} câu đang chờ ôn tập

source: Welcome!
ar: مرحباً!
de: Willkommen!
id: Selamat datang!
ko: 환영합니다!
th: ยินดีต้อนรับ!
vi: Chào mừng!

# selectLevel
source: Select your target level
ar: اختر المستوى المستهدف
de: Wähle dein Zielniveau
id: Pilih level target
ko: 목표 레벨을 선택하세요
th: เลือกระดับเป้าหมาย
vi: Chọn cấp độ mục tiêu

# canChangeInSettings
source: You can change this in settings later
ar: يمكنك تغييره لاحقاً في الإعدادات
de: Du kannst es später in den Einstellungen ändern
id: Bisa diubah nanti di pengaturan
ko: 나중에 설정에서 변경할 수 있어요
th: เปลี่ยนได้ภายหลังในตั้งค่า
vi: Có thể thay đổi sau trong cài đặt

source: Start
ar: ابدأ
de: Starten
id: Mulai
ko: 시작하기
th: เริ่มต้น
vi: Bắt đầu

# levelTarget
source: Target Level
ar: المستوى المستهدف
de: Zielniveau
id: Level target
ko: 목표 레벨
th: ระดับเป้าหมาย
vi: Cấp độ mục tiêu

# levelNameA1
source: Beginner
ar: مبتدئ
de: Anfänger
id: Pemula
ko: 입문
th: เริ่มต้น
vi: Sơ cấp

# levelNameA2
source: Elementary
ar: أساسي
de: Grundstufe
id: Dasar
ko: 초급
th: พื้นฐาน
vi: Cơ bản

# levelNameB1
source: Intermediate
ar: متوسط
de: Mittelstufe
id: Menengah
ko: 중급
th: กลาง
vi: Trung cấp

# levelNameB2
source: Upper Intermediate
ar: فوق المتوسط
de: Obere Mittelstufe
id: Menengah atas
ko: 중상급
th: กลาง-สูง
vi: Trung cấp cao

# levelNameC1
source: Advanced
ar: متقدم
de: Fortgeschritten
id: Mahir
ko: 상급
th: สูง
vi: Cao cấp

# levelNameC2
source: Mastery
ar: إتقان
de: Meisterniveau
id: Penguasaan
ko: 최상급
th: เชี่ยวชาญ
vi: Thành thạo

source: Grammar
ar: القواعد
de: Grammatik
id: Tata bahasa
ko: 문법
th: ไวยากรณ์
vi: Ngữ pháp

source: Vocabulary
ar: المفردات
de: Wortschatz
id: Kosakata
ko: 어휘
th: คำศัพท์
vi: Từ vựng

# grammarAndVocabulary
source: Grammar & Vocabulary
ar: القواعد والمفردات
de: Grammatik & Wortschatz
id: Tata bahasa & Kosakata
ko: 문법 & 어휘
th: ไวยากรณ์และคำศัพท์
vi: Ngữ pháp & Từ vựng

source: No wrong answers!
ar: لا توجد أخطاء!
de: Keine Fehler!
id: Tidak ada jawaban salah!
ko: 틀린 문제가 없어요!
th: ไม่มีข้อผิด!
vi: Không có câu sai!

# noWrongAnswersDesc
source: You're doing great! Keep up the good work and continue building your skills!
ar: أنت تبلي بلاءً حسناً! استمر في ذلك!
de: Du machst das großartig! Weiter so!
id: Kamu hebat! Terus semangat!
ko: 꾸준히 학습하며 실력을 쌓아가고 있네요. 앞으로도 화이팅!
th: คุณทำได้ดีมาก! เก่งมาก สู้ต่อไป!
vi: Bạn đang làm rất tốt! Hãy tiếp tục phát huy!

# wrongCount
source: Wrong {count} times
ar: خطأ {count} مرات
de: {count} Mal falsch
id: Salah {count} kali
ko: {count}회 틀림
th: ผิด {count} ครั้ง
vi: Sai {count} lần

source: Correct Answer
ar: الإجابة الصحيحة
de: Richtige Antwort
id: Jawaban benar
ko: 정답
th: คำตอบที่ถูก
vi: Đáp án đúng

source: Your Answer
ar: إجابتك
de: Deine Antwort
id: Jawabanmu
ko: 내가 고른 답
th: คำตอบของคุณ
vi: Câu trả lời của bạn

source: Explanation
ar: الشرح
de: Erklärung
id: Penjelasan
ko: 해설
th: คำอธิบาย
vi: Giải thích

source: Premium
ar: مميز
ko: 프리미엄
th: พรีเมียม

source: Remove Ads
ar: إزالة الإعلانات
de: Werbung entfernen
id: Hapus iklan
ko: 광고 제거
th: ลบโฆษณา
vi: Xóa quảng cáo

source: Premium activated
ar: تم تفعيل المميز
de: Premium aktiviert
id: Premium diaktifkan
ko: 프리미엄이 활성화되었습니다
th: เปิดใช้งานพรีเมียมแล้ว
vi: Đã kích hoạt Premium

source: Purchase
ar: شراء
de: Kaufen
id: Beli
ko: 구매
th: ซื้อ
vi: Mua

source: Restore Purchases
ar: استعادة المشتريات
de: Käufe wiederherstellen
id: Pulihkan pembelian
ko: 구매 복원
th: กู้คืนการซื้อ
vi: Khôi phục mua hàng

source: Purchase failed
ar: فشل الشراء
ko: 구매에 실패했습니다

source: Purchases restored
ar: تم استعادة المشتريات
ko: 구매가 복원되었습니다

source: Product not available
ar: المنتج غير متاح
ko: 상품을 불러올 수 없습니다

source: Study Notification
ar: تذكير الدراسة
de: Lernerinnerung
id: Pengingat belajar
ko: 학습 알림
th: แจ้งเตือนการเรียน
vi: Nhắc nhở học

# dailyNotification
source: Study reminder when inactive for over a day
ar: تذكير بالدراسة عند عدم الدخول لأكثر من يوم
de: Tägliche Erinnerung zur festgelegten Zeit
id: Pengingat harian pada waktu yang ditentukan
ko: 하루 이상 접속하지 않으면 학습 알림
th: แจ้งเตือนรายวันตามเวลาที่ตั้ง
vi: Nhắc nhở hàng ngày theo giờ đã đặt

source: Notification off
ar: الإشعارات معطلة
de: Benachrichtigungen aus
id: Notifikasi mati
ko: 알림 꺼짐
th: ปิดการแจ้งเตือน
vi: Tắt thông báo

source: Notification Time
ar: وقت الإشعار
de: Benachrichtigungszeit
id: Waktu notifikasi
ko: 알림 시간
th: เวลาแจ้งเตือน
vi: Thời gian thông báo

# notificationChannelName
source: Study Reminder
ar: تذكير الدراسة
de: Lernerinnerung
id: Pengingat belajar
ko: 학습 리마인더
th: แจ้งเตือนการเรียน
vi: Nhắc nhở học

# notificationChannelDesc
source: Daily study time reminders
ar: تذكيرات يومية للدراسة
de: Tägliche Lernerinnerungen
id: Pengingat belajar harian
ko: 매일 학습 시간을 알려드립니다
th: แจ้งเตือนเวลาเรียนรายวัน
vi: Nhắc nhở học hàng ngày

# notificationTitle
source: Easy Spanish
ar: إسبانية سهلة
de: Spanisch Leicht
id: Spanyol Mudah
ko: 쉬운 스페인어
th: สเปนง่ายๆ
vi: Học Tây Ban Nha

# notificationBody
source: Time to start today's study!
ar: حان وقت بدء الدراسة!
de: Zeit, mit dem Lernen zu beginnen!
id: Waktunya mulai belajar!
ko: 오늘의 학습을 시작할 시간이에요!
th: ถึงเวลาเริ่มเรียนแล้ว!
vi: Đến giờ bắt đầu học rồi!

source: Language
ar: اللغة
de: Sprache
id: Bahasa
ko: 언어
th: ภาษา
vi: Ngôn ngữ

source: Select Language
ar: اختيار اللغة
de: Sprache wählen
id: Pilih bahasa
ko: 언어 선택
th: เลือกภาษา
vi: Chọn ngôn ngữ

# languageSystem
source: System Default
ar: النظام
de: Systemstandard
id: Sistem
ko: 시스템 설정
th: ตามระบบ
vi: Theo hệ thống

# soundAndVibration
source: Sound & Vibration
ar: الصوت والاهتزاز
de: Ton & Vibration
id: Suara & getar
ko: 사운드 및 진동
th: เสียงและการสั่น
vi: Âm thanh & rung

source: Sound Effects
ar: المؤثرات الصوتية
de: Soundeffekte
id: Efek suara
ko: 효과음
th: เอฟเฟกต์เสียง
vi: Hiệu ứng âm thanh

# soundEffectsDesc
source: Play sound on correct/wrong answers
ar: تشغيل صوت عند الإجابة الصحيحة/الخاطئة
de: Ton bei richtiger/falscher Antwort abspielen
id: Putar suara saat benar/salah
ko: 정답/오답 시 효과음 재생
th: เล่นเสียงเมื่อตอบถูก/ผิด
vi: Phát âm thanh khi đúng/sai

source: Vibration
ar: الاهتزاز
id: Getar
ko: 진동
th: การสั่น
vi: Rung

# vibrationDesc
source: Haptic feedback on correct/wrong answers
ar: اهتزاز عند الإجابة الصحيحة/الخاطئة
de: Vibration bei richtiger/falscher Antwort
id: Getar saat benar/salah
ko: 정답/오답 시 진동 피드백
th: สั่นเมื่อตอบถูก/ผิด
vi: Rung khi đúng/sai

# ttsSettings
source: Voice Settings
ar: إعدادات الصوت
de: TTS-Einstellungen
id: Pengaturan TTS
ko: 음성 설정
th: ตั้งค่าเสียง
vi: Cài đặt giọng nói

# ttsAutoPlay
source: Auto Play
ar: تشغيل تلقائي
de: Automatische Wiedergabe
id: Putar otomatis
ko: 자동 재생
th: เล่นอัตโนมัติ
vi: Tự động phát

# ttsAutoPlayDesc
source: Auto-pronounce Spanish on correct answer
ar: نطق الإسبانية تلقائياً عند الإجابة الصحيحة
de: Spanisch automatisch aussprechen bei richtiger Antwort
id: Ucapkan bahasa Spanyol otomatis saat benar
ko: 정답 확인 시 스페인어 자동 발음
th: ออกเสียงสเปนอัตโนมัติเมื่อตอบถูก
vi: Tự động phát âm tiếng Tây Ban Nha khi đúng

# ttsSpeechRate
source: Speech Rate
ar: السرعة
ko: 재생 속도
th: ความเร็ว
vi: Tốc độ

# ttsVoice
source: Voice
ar: الصوت
ko: 음성 선택
th: เสียง
vi: Giọng nói

# ttsVoiceDefault
source: Default
ar: الافتراضي
ko: 기본 음성
th: ค่าเริ่มต้น
vi: Mặc định

# ttsSpeedSlow
source: Slow
ar: بطيء
ko: 느리게
th: ช้า
vi: Chậm

# ttsSpeedNormal
source: Normal
ar: عادي
ko: 보통
th: ปกติ
vi: Bình thường

# ttsSpeedFast
source: Fast
ar: سريع
ko: 빠르게
th: เร็ว
vi: Nhanh

# ttsTestPlay
source: Preview
ar: معاينة
ko: 미리 듣기
th: ฟังตัวอย่าง
vi: Nghe thử

source: Show Hint
ar: عرض التلميح
de: Hinweis anzeigen
id: Lihat petunjuk
ko: 힌트 보기
th: ดูคำใบ้
vi: Xem gợi ý

source: Next Question
ar: السؤال التالي
de: Nächste Frage
id: Pertanyaan berikutnya
ko: 다음 문제
th: คำถามถัดไป
vi: Câu tiếp theo

source: Key Points
ar: النقاط الرئيسية
de: Wichtige Punkte
id: Poin penting
ko: 핵심 포인트
th: ประเด็นสำคัญ
vi: Điểm chính

# theoryComplete
source: Complete
ar: إكمال
de: Abschließen
id: Selesai
ko: 학습 완료
th: เสร็จสิ้น
vi: Hoàn thành

# excellentComplete
source: Excellent!
ar: ممتاز!
de: Ausgezeichnet!
id: Luar biasa!
ko: 훌륭해요!
th: ยอดเยี่ยม!
vi: Xuất sắc!

# goodComplete
source: Good Job!
ar: عمل جيد!
de: Gut gemacht!
id: Bagus!
ko: 잘했어요!
th: ทำได้ดี!
vi: Làm tốt lắm!

source: Phase Results
ar: نتائج المراحل
de: Phasenergebnisse
id: Hasil per fase
ko: 단계별 결과
th: ผลลัพธ์ตามขั้นตอน
vi: Kết quả theo giai đoạn

# additionalStudy
source: Study More
ar: متابعة الدراسة
de: Weiter lernen
id: Lanjut belajar
ko: 추가 학습하기
th: เรียนต่อ
vi: Học thêm

# continueReviewWithCount
source: Continue Review ({count} remaining)
ar: متابعة المراجعة ({count} متبقية)
de: Weiter wiederholen ({count} übrig)
id: Lanjut ulasan ({count} tersisa)
ko: 이어서 복습 ({count}개 남음)
th: ทบทวนต่อ (เหลือ {count} ข้อ)
vi: Tiếp tục ôn tập (còn {count} câu)

source: Total Studied
ar: إجمالي المدروس
de: Gesamt gelernt
id: Total dipelajari
ko: 총 학습 문제
th: เรียนทั้งหมด
vi: Tổng đã học

source: Accuracy Rate
ar: نسبة الدقة
de: Erfolgsrate
id: Tingkat akurasi
ko: 정답률
th: อัตราความถูกต้อง
vi: Tỉ lệ đúng

source: Study Days
ar: أيام الدراسة
de: Lerntage
id: Hari belajar
ko: 학습 일수
th: จำนวนวันเรียน
vi: Số ngày học

source: Study Time
ar: وقت الدراسة
de: Lernzeit
id: Waktu belajar
ko: 학습 시간
th: เวลาเรียน
vi: Thời gian học

source: Current Streak
ar: السلسلة الحالية
de: Aktuelle Serie
id: Seri saat ini
ko: 현재 연속 학습
th: เรียนต่อเนื่องปัจจุบัน
vi: Chuỗi hiện tại

source: Longest Streak
ar: أطول سلسلة
de: Längste Serie
id: Seri terpanjang
ko: 최장 연속 학습
th: เรียนต่อเนื่องสูงสุด
vi: Chuỗi dài nhất

# streakEncouragement
source: Keep studying to level up your skills!
ar: استمر في الدراسة لتتحسن!
de: Lerne weiter, um dich zu verbessern!
id: Terus belajar untuk berkembang!
ko: 꾸준히 학습하면 실력이 쑥쑥 올라요!
th: เรียนต่อเนื่องเพื่อพัฒนาทักษะ!
vi: Tiếp tục học để tiến bộ!

# noStudyYet
source: No study records yet
ar: لا توجد سجلات دراسة بعد
de: Noch keine Lernaufzeichnungen
id: Belum ada data belajar
ko: 아직 학습 기록이 없어요
th: ยังไม่มีบันทึกการเรียน
vi: Chưa có dữ liệu học

# daysUnit
source: {count} days
ar: {count} أيام
de: {count} Tage
id: {count} hari
ko: {count}일
th: {count} วัน
vi: {count} ngày

# minutes
source: {count} min
ar: {count} دقيقة
id: {count} menit
ko: {count}분
th: {count} นาที
vi: {count} phút

source: Select Daily Goal
ar: اختيار الهدف اليومي
de: Tagesziel wählen
id: Pilih target harian
ko: 일일 학습량 선택
th: เลือกเป้าหมายรายวัน
vi: Chọn mục tiêu hàng ngày

source: Select Target Level
ar: اختيار المستوى المستهدف
de: Zielniveau wählen
id: Pilih level target
ko: 목표 레벨 선택
th: เลือกระดับเป้าหมาย
vi: Chọn cấp độ mục tiêu

# notificationMsg1
source: Your Spanish skills are waiting! Ready to take another step today?
ar: مهاراتك في الإسبانية بانتظارك! هل أنت مستعد لخطوة أخرى اليوم؟
ko: 스페인어 실력이 기다리고 있어요! 오늘도 한 걸음 나아가볼까요?

# notificationMsg2
source: Remember what you learned yesterday? Reviewing helps you remember longer!
ar: هل تتذكر ما تعلمته بالأمس؟ المراجعة تساعدك على التذكر لفترة أطول!
ko: 어제 배운 내용, 기억나시나요? 복습하면 더 오래 기억돼요!

# notificationMsg3
source: A little every day goes a long way! Start your Spanish lesson today.
ar: قليل كل يوم يصنع فرقاً كبيراً! ابدأ درس الإسبانية اليوم.
ko: 매일 조금씩, 꾸준히! 오늘의 스페인어 학습을 시작해보세요.

# notificationMsg4
source: Â¡Hola! We've missed you. Let's study Spanish together today!
ar: ¡Hola! افتقدناك. لنتعلم الإسبانية معاً اليوم!
ko: ¡Hola! 스페인어가 보고 싶었어요. 오늘도 함께 공부해요!

# notificationMsg5
source: Don't break your streak! Start studying now before it's too late.
ar: لا تكسر سلسلة تعلمك! ابدأ الدراسة الآن.
ko: 학습 연속 기록이 끊기기 전에! 지금 바로 시작해볼까요?
